Lugi55/FB_V1/HB_V1.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Core/Src
NVIC.ADC1_2_IRQn=true\:0\:0\:false\:true\:true\:1\:true\:true
HRTIM1.CompareValue1-Output_TE1TE2=0
ADC2.ExternalTrigConv=ADC_EXTERNALTRIG_HRTIM_TRG1
PA6.Mode=IN3-Single-Ended
RCC.USART1Freq_Value=85000000
RCC.SAI1Freq_Value=170000000
RCC.CortexFreq_Value=170000000
HRTIM1.SetOutput1_Source1-Output_TE1TE2=HRTIM_OUTPUTSET_TIMPER
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G474RETx
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_HRTIM1_Init-HRTIM1-false-HAL-true,4-MX_ADC2_Init-ADC2-false-HAL-true,5-MX_USART1_UART_Init-USART1-false-HAL-true,6-MX_ADC1_Init-ADC1-false-HAL-true
PC9.Locked=true
RCC.USART2Freq_Value=170000000
PC5.Mode=Asynchronous
USART1.IPParameters=VirtualMode-Asynchronous
PC13.GPIO_Label=LED3
PinOutPanel.RotationAngle=0
HRTIM1.ResetOutput1_Source1-Output_TE1TE2=HRTIM_OUTPUTRESET_TIMCMP2
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.LPTIM1Freq_Value=170000000
RCC.I2C3Freq_Value=170000000
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=170000000
Mcu.IP5=SYS
Mcu.IP2=HRTIM1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=NVIC
Mcu.IP0=ADC1
PB4.GPIOParameters=GPIO_Label
Mcu.IP1=ADC2
HRTIM1.NumberSetSource1-Output_TE1TE2=1
Mcu.UserConstants=DEADTIME,50;PERIOD_100,54400;BLANKING,100;MAX_PERIOD,40800
HRTIM1.ResetOutput1_Source2-Output_TE1TE2=HRTIM_OUTPUTRESET_TIMCMP1
Mcu.ThirdPartyNb=0
HRTIM1.ADCTrigger3_Source1=HRTIM_ADCTRIGGEREVENT13_TIMERE_CMP3
RCC.HCLKFreq_Value=170000000
RCC.I2C4Freq_Value=170000000
Mcu.IPNb=7
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=170000000
Mcu.Pin6=PC8
Mcu.Pin7=PC9
Mcu.Pin8=PC11
Mcu.Pin9=PB4
RCC.AHBFreq_Value=170000000
Mcu.Pin0=PC13
Mcu.Pin1=PC0
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA4
Mcu.Pin3=PA6
RCC.USART3Freq_Value=170000000
Mcu.Pin4=PC4
Mcu.Pin5=PC5
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_6
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.Locked=true
RCC.ADC12Freq_Value=170000000
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
HRTIM1.CompareUnit3-Output_TE1TE2=HRTIM_COMPAREUNIT_3
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.4.0
MxDb.Version=DB.6.0.21
ProjectManager.BackupPrevious=false
HRTIM1.GreaterCMP3_TE=HRTIM_TIMERGTCMP3_EQUAL
RCC.VCOInputFreq_Value=4000000
PC11.GPIO_Label=tg1
File.Version=6
HRTIM1.NumberResetSource1-Output_TE1TE2=2
PC9.Mode=Output_TE1TE2
PC11.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
RCC.PLLRCLKFreq_Value=170000000
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=HB_V1
RCC.CRSFreq_Value=48000000
Mcu.Package=LQFP64
HRTIM1.FallingValue-Output_TE1TE2=DEADTIME
PA6.Signal=ADC2_IN3
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
HRTIM1.CompareValue3-Output_TE1TE2=BLANKING
RCC.LSCOPinFreq_Value=32000
HRTIM1.CompareUnit1-Output_TE1TE2=HRTIM_COMPAREUNIT_1
HRTIM1.ADCTrigger1_Source1=HRTIM_ADCTRIGGEREVENT13_TIMERE_CMP3
HRTIM1.NumberADCTriggerSource1=1
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.PLLPoutputFreq_Value=170000000
HRTIM1.NumberADCTriggerSource3=1
HRTIM1.CompareUnit2-Output_TE1TE2=HRTIM_COMPAREUNIT_2
RCC.APB1TimFreq_Value=170000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=170000000
PC5.Signal=USART1_RX
HRTIM1.CompareValue2-Output_TE1TE2=MAX_PERIOD
SH.COMP_DAC11_group.ConfNb=1
ProjectManager.CustomerFirmwarePackage=
HRTIM1.NumberResetSource2_TE=0
PC4.Mode=Asynchronous
RCC.HSI48_VALUE=48000000
PB4.Signal=GPIO_Output
RCC.I2SFreq_Value=170000000
RCC.PLLQoutputFreq_Value=170000000
HRTIM1.RisingValue-Output_TE1TE2=DEADTIME
ProjectManager.ProjectFileName=HB_V1.ioc
HRTIM1.ResetOutput2_Source1-Output_TE1TE2=HRTIM_OUTPUTRESET_TIMCMP1
Mcu.PinsNb=12
HRTIM1.CompareUnit4-Output_TE1TE2=__NULL
ProjectManager.NoMain=false
PC11.Locked=true
ADC1.IPParameters=master,NbrOfConversionFlag,Channel-0\#ChannelRegularConversion,ExternalTrigConv
PC13.Locked=true
PC13.Signal=GPIO_Output
PC11.Signal=GPIO_Output
PC8.Signal=HRTIM1_CHE1
PC4.Signal=USART1_TX
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PC0.Signal=ADC1_IN6
PC11.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
RCC.QSPIFreq_Value=170000000
RCC.FamilyName=M
HRTIM1.SetOutput2_Source1-Output_TE1TE2=HRTIM_OUTPUTSET_TIMCMP1
PC0.Mode=IN6-Single-Ended
USART1.VirtualMode-Asynchronous=VM_ASYNC
ProjectManager.TargetToolchain=STM32CubeIDE
HRTIM1.postscaler1=10
SH.COMP_DAC11_group.0=DAC1_OUT1
ADC2.IPParameters=NbrOfConversionFlag,Channel-4\#ChannelRegularConversion,ExternalTrigConv
HRTIM1.Polarity2-Output_TE1TE2=HRTIM_OUTPUTPOLARITY_HIGH
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=170000000
RCC.LSE_VALUE=32768
HRTIM1.ADCTrigger_Id1=HRTIM_ADCTRIGGER_1
HRTIM1.ADCTrigger_Id3=__NULL
board=custom
RCC.VCOOutputFreq_Value=340000000
ProjectManager.LastFirmware=true
RCC.ADC345Freq_Value=170000000
RCC.APB2Freq_Value=85000000
RCC.UART4Freq_Value=170000000
PC11.PinState=GPIO_PIN_RESET
MxCube.Version=6.2.1
PB4.GPIO_Label=LED4
RCC.I2C1Freq_Value=170000000
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
PC13.GPIOParameters=GPIO_Label
RCC.FDCANFreq_Value=170000000
RCC.RNGFreq_Value=170000000
VP_SYS_VS_Systick.Mode=SysTick
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.UART5Freq_Value=170000000
ProjectManager.FreePins=false
RCC.IPParameters=ADC12Freq_Value,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G474R(B-C-E)Tx
ProjectManager.UnderRoot=true
ADC1.ExternalTrigConv=ADC_EXTERNALTRIG_HRTIM_TRG1
Mcu.IP6=USART1
PC8.Mode=Output_TE1TE2
ProjectManager.CoupleFile=true
PB4.Locked=true
PA4.Signal=COMP_DAC11_group
RCC.SYSCLKFreq_VALUE=170000000
ADC1.master=1
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=VP_SYS_VS_DBSignals
RCC.PLLM=RCC_PLLM_DIV4
RCC.PLLN=85
Mcu.Pin10=VP_SYS_VS_Systick
RCC.PWRFreq_Value=170000000
PC8.Locked=true
PC9.Signal=HRTIM1_CHE2
RCC.I2C2Freq_Value=170000000
HRTIM1.DeadTimeInsertion-Output_TE1TE2=HRTIM_TIMDEADTIMEINSERTION_ENABLED
RCC.APB1Freq_Value=170000000
ADC2.Channel-4\#ChannelRegularConversion=ADC_CHANNEL_3
ProjectManager.DeviceId=STM32G474RETx
HRTIM1.Periode_TE=PERIOD_100
ProjectManager.LibraryCopy=1
HRTIM1.IPParameters=Periode_TE,CompareUnit1-Output_TE1TE2,NumberSetSource1-Output_TE1TE2,NumberResetSource1-Output_TE1TE2,SetOutput1_Source1-Output_TE1TE2,ResetOutput1_Source1-Output_TE1TE2,NumberResetSource2_TE,Polarity2-Output_TE1TE2,SetOutput2_Source1-Output_TE1TE2,ResetOutput2_Source1-Output_TE1TE2,ADCTrigger_Id1,NumberADCTriggerSource1,postscaler1,ADCTrigger1_Source1,DeadTimeInsertion-Output_TE1TE2,RisingValue-Output_TE1TE2,FallingValue-Output_TE1TE2,CompareUnit2-Output_TE1TE2,CompareValue2-Output_TE1TE2,CompareUnit3-Output_TE1TE2,CompareValue3-Output_TE1TE2,ADCTrigger_Id3,NumberADCTriggerSource3,ADCTrigger3_Source1,GreaterCMP3_TE,CompareValue1-Output_TE1TE2,CompareUnit4-Output_TE1TE2,ResetOutput1_Source2-Output_TE1TE2
PA6.Locked=true
isbadioc=false
